// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// Console.WriteLine("Введите любое трёхзначное число (от 100 до 999)");
// int x=Convert.ToInt32(Console.ReadLine());
// int y = x%100;
// int z = y/10;
// Console.WriteLine ($"Вторая цифра, введенной вами числа - {z}");

//НЕ РЕШЕНО!!! Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// Console.WriteLine("Введите любое число");
// int x=Convert.ToInt32(Console.ReadLine());
// int y = x%z;
// if (x<100) Console.WriteLine("В числе нет третьей цифры");
// else if (99<x || x<1000) z = 100; Console.WriteLine ($"Третья цифра - {y}");

//Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// Console.WriteLine("Введите число, соответсвующее дню недели");
// int x=Convert.ToInt32(Console.ReadLine());
// if (x == 6) Console.WriteLine("Это выходной день - СУББОТА!");
// else if (x == 7) Console.WriteLine("Это выходной день - Воскресенье. Уже!");
// else if (x < 6) Console.WriteLine("Это будний день");
// else Console.WriteLine("В неделе только 7 дней Оо");